Arellano1904/Texas-Instruments-TivaC/EK-TM4C123GXL/projects/2.4inchDisplay/drivers/2.4inchDisplay.c
    if (value < 0)
    {
        buf[j++] = '-';
        value = -value;
    }

    while (value > 0)
    {
        tmp[i++] = (value % 10) + '0';
        value /= 10;
    }

    while (i > 0)
        buf[j++] = tmp[--i];

    buf[j] = '\0';
}

static void floatToStr(float value, char *buf, uint8_t decimals){
    int32_t intPart;
    float frac;
    int i = 0, j = 0;
    uint8_t d;

    if (value < 0.0f)
    {
        buf[i++] = '-';
        value = -value;
    }

    // Round to the requested number of decimals so the last digit is correct
    // (e.g. 1.999 with 2 decimals -> "2.00" instead of truncating to "1.99").
    // The carry from rounding may also bump the integer part, so do it first.
    float rounding = 0.5f;
    for (d = 0; d < decimals; d++)
        rounding *= 0.1f;
    value += rounding;

    intPart = (int32_t)value;
    frac = value - (float)intPart;

    // Integer part
    char intBuf[12];
    intToStr(intPart, intBuf);

    for (j = 0; intBuf[j]; j++)
        buf[i++] = intBuf[j];

    // Fractional part (only when decimals were requested)
    if (decimals > 0)
    {
        buf[i++] = '.';
        while (decimals--)
        {
            frac *= 10.0f;
            int digit = (int)frac;
            if (digit > 9) digit = 9;       // guard against fp rounding to 10
            buf[i++] = (char)('0' + digit);
            frac -= digit;
        }
    }

    buf[i] = '\0';
}

// //*****************************************************************************
// // Backlight brightness control.
// //
// // The panel backlight is driven by M0PWM2 (PF2); its duty cycle sets the
// // brightness. A control voltage on AIN0 (PE3) is sampled by ADC0 sequencer 3,
// // and the ADC interrupt maps the reading (0..4095) onto the PWM duty cycle.
// // ADC0 SS3 is triggered by PWM generator 1, so conversions are paced by the
// // backlight PWM itself.
// //*****************************************************************************
// #define PWM_FREQ 500U   // Backlight PWM frequency (Hz)

// // Latest raw ADC0 SS3 sample (0..4095). Written by the ISR, read by the app.
// volatile uint32_t adc0Ssq3Value = 0x0000;
// // Set to 1 by the ADC ISR when a new sample is ready; cleared by the consumer.
// volatile uint8_t adc_ready = 0x00;
// // Backlight duty cycle, 0.0..1.0. Updated from the ADC reading in the ISR.
// volatile float fDutyCycle = 0.50f;   // 50%
// // PWM period in clock ticks, computed at runtime from the system clock.
// static uint32_t pwmLoad = 0x0000;
// // PWM pulse width in clock ticks (derived from fDutyCycle).
// static uint32_t ui32Width = 0x0000;

// void display_adc_config(void){
//     // Enable the ADC module and related peripheral
//     MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
//     // Wait for the ADC0 module to be ready
//     while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_ADC0));
//     MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
//     while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOE));
//     // Disable digital function on the pin
//     MAP_GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_3);
//     // Config ADC clock
//     ADCClockConfigSet(ADC0_BASE,ADC_CLOCK_SRC_PLL | ADC_CLOCK_RATE_FULL,12);
//     // Use VDDA (3.3 V)
//     MAP_ADCReferenceSet(ADC0_BASE, ADC_REF_INT);
//     // Configure ADC oversampling
//     MAP_ADCHardwareOversampleConfigure(ADC0_BASE, 0);
//     // Disable sequencer 3 during config
//     MAP_ADCSequenceDisable(ADC0_BASE, 3);
//     // Enable the first sample sequencer to capture the value of channel 0 when the processor trigger occurs
//     MAP_ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_PWM_MOD0 | ADC_TRIGGER_PWM1, 0);
//     // Configure sequencer steps
//     MAP_ADCSequenceStepConfigure(ADC0_BASE, 3, 0,ADC_CTL_IE | ADC_CTL_END | ADC_CTL_CH0);
//     // Clear ADC0 Sequencer 3 interrupt
//     MAP_ADCIntClear(ADC0_BASE, 3);
//     // Enable ADC0 Sequencer 3 interrupt
//     MAP_ADCIntEnable(ADC0_BASE, 3);
//     // Enable interrupt in NVIC
//     MAP_IntEnable(INT_ADC0SS3);
//     // Enable ADC sequencer
//     MAP_ADCSequenceEnable(ADC0_BASE, 3);

// }
// // ADC0 Sequencer 3 interrupt handler
// void display_adc_handler(void){
//     uint32_t sample = 0;
//     // ALWAYS clear first, before reading
//     MAP_ADCIntClear(ADC0_BASE, 3);
//     // Read ADC result into a non-volatile local, then publish it (avoids
//     // passing a volatile pointer to the DriverLib API).
//     MAP_ADCSequenceDataGet(ADC0_BASE, 3, &sample);
//     adc0Ssq3Value = sample;
//     // Update PWM duty cycle based on ADC reading (0-4095 -> 0-100%)
//     fDutyCycle = (float)sample / 4095.0f;
//     ui32Width  = (uint32_t)(pwmLoad * fDutyCycle);
//     // Clamp: PWM hardware requires 1 <= width <= (pwmLoad - 1)
//     // If width == 0 or >= pwmLoad the comparator never fires -> output glitches
//     if(ui32Width < 1)           ui32Width = 1;
//     if(ui32Width > pwmLoad - 1) ui32Width = pwmLoad - 1;
//     MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, ui32Width);
//     // Signal main loop that a new ADC value is ready
//     adc_ready = 0x01;
// }

// void display_pwm_config(void){
//     // Enabling and waiting for related peripheral
//     MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
//     while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0));
//     MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
//     while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOF)); 
//     // Configure pin PF2 as PWM output
//     MAP_GPIOPinConfigure(GPIO_PF2_M0PWM2);
//     MAP_GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);
//     // Config PWM module clock
//     MAP_PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_2);
//     // PWM period in ticks, derived from the system clock (PWM_SYSCLK_DIV_2 halves it)
//     pwmLoad = (MAP_SysCtlClockGet() / 2U) / PWM_FREQ;
//     // Config PWM generator
//     MAP_PWMGenConfigure(PWM0_BASE,PWM_GEN_1,PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC | PWM_GEN_MODE_DBG_STOP);
//     // Enable PWM triger output
//     PWMGenIntTrigEnable(PWM0_BASE, PWM_GEN_1, PWM_TR_CNT_ZERO);
//     // Set PWM period
//     MAP_PWMGenPeriodSet(PWM0_BASE,PWM_GEN_1,pwmLoad);
//     // Set PWM pulse width
//     ui32Width = (uint32_t)(pwmLoad * fDutyCycle);
//     MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, ui32Width);
//     // Enable PWM output
//     MAP_PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);
//     MAP_PWMGenEnable(PWM0_BASE, PWM_GEN_1);
// }

//*****************************************************************************
// //***** Touch (XPT2046) functions *****//
//*****************************************************************************

void touch_enable(void){
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, 0x00);
}

