Arellano1904/Texas-Instruments-TivaC/EK-TM4C123GXL/projects/2.4inchDisplay/drivers/2.4inchDisplay.c
void touch_disable(void){
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, GPIO_PIN_0);
}
// Clock one channel: a 16-bit command frame followed by a 16-bit frame that
// shifts out the BUSY bit + the 12 data bits. The command sits in the low byte
// so the leading zero byte acts as the start-bit gap; on the next frame the
// result lands left-aligned, so (rx >> 3) drops BUSY and the 3 trailing bits.
// Returns the averaged 0..4095 sample. CS is owned by the caller so several
// channels can share a single assertion.
static uint16_t touch_read_raw(uint8_t cmd){
    uint32_t rx;
    uint32_t acc = 0;
    uint8_t i;
    for(i = 0; i < XPT2046_SAMPLES; i++){
        MAP_SSIDataPut(SSI0_BASE, (uint16_t)cmd);   // send command
        MAP_SSIDataGet(SSI0_BASE, &rx);             // discard command echo
        MAP_SSIDataPut(SSI0_BASE, 0x0000);          // clock out the result
        MAP_SSIDataGet(SSI0_BASE, &rx);
        acc += (rx >> 3) & 0x0FFF;
    }
    return (uint16_t)(acc / XPT2046_SAMPLES);
}

// Linear map of a raw reading onto [0, out_max], clamped at the edges.
static uint16_t touch_scale(uint16_t raw, uint16_t in_min, uint16_t in_max, uint16_t out_max){
    if(raw <= in_min){ return 0; }
    if(raw >= in_max){ return out_max; }
    return (uint16_t)(((uint32_t)(raw - in_min) * out_max) / (in_max - in_min));
}

uint8_t touch_request_coords(void){
    uint32_t flush;
    uint16_t raw_x, raw_y;

    // Release bounce latches one last touch event as the pen lifts. If PENIRQ
    // is already high the plates are floating and any conversion is garbage,
    // so refuse the request and keep the previous coordinates.
    if(MAP_GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_2)) return 0;

    // Reading the controller makes PENIRQ pulse, which would otherwise queue a
    // spurious touch interrupt and keep touch_asserted stuck set. Mask PB2 for
    // the duration of the transfer.
    MAP_GPIOIntDisable(GPIO_PORTB_BASE, GPIO_PIN_2);

    touch_enable();                                         // CS low
    while(MAP_SSIDataGetNonBlocking(SSI0_BASE, &flush)){}   // drop stale RX data

    raw_x = touch_read_raw(XPT2046_CMD_X);
    raw_y = touch_read_raw(XPT2046_CMD_Y);

    while(MAP_SSIBusy(SSI0_BASE)){}                         // let the last frame finish
    touch_disable();                                        // CS high

    // Discard the glitch the read produced, then re-arm the touch interrupt.
    MAP_GPIOIntClear(GPIO_PORTB_BASE, GPIO_PIN_2);
    MAP_GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_2);

    // With CS high again PENIRQ reflects the pen state: if it rose, the pen
    // lifted mid-read and the samples are unreliable — discard them.
    if(MAP_GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_2)) return 0;

    // Keep the raw readings so the calibration limits can be measured.
    touch_raw_x = raw_x;
    touch_raw_y = raw_y;

    // Portrait-flipped panel: both axes run opposite to the raw ADC sweep, so
    // invert each mapped result. The cal_* limits come from touch_calibration();
    // swap the channel->axis assignment if the panel is mounted rotated 90 degrees.
    touch_x = (ILI9341_WIDTH - 1) - touch_scale(raw_x, cal_x_min, cal_x_max, ILI9341_WIDTH - 1);
    touch_y = (ILI9341_HEIGHT - 1) - touch_scale(raw_y, cal_y_min, cal_y_max, ILI9341_HEIGHT - 1);

    return 1;
}

// Blocks until PENIRQ has stayed high (pen up) for a while, then drops the
// spurious events the release bounce latched.
static void touch_cal_wait_release(void){
    uint16_t stable = 0;
    while(stable < 50){
        stable = MAP_GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_2) ? stable + 1 : 0;
        delay_ms(1);
    }
    touch_pressed();
}

// Draws a cross centered on (sx, sy), blocks until a valid press lands and
// returns its raw ADC readings, then erases the cross and waits for release.
static void touch_cal_point(uint16_t sx, uint16_t sy, uint16_t *rx, uint16_t *ry){
    // The '+' glyph cross sits ~(+4, +8) from the character origin.
    uint16_t cx = sx - 4, cy = sy - 8;
    display_draw_char(cx, cy, '+', WHITE, BLACK);
    for(;;){
        if(touch_pressed() && touch_request_coords()){
            *rx = touch_get_raw_x();
            *ry = touch_get_raw_y();
            break;
        }
    }
    display_draw_char(cx, cy, ' ', BLACK, BLACK);
    touch_cal_wait_release();
}

// Interactive two-point calibration: sample the raw ADC at two crosses near
// opposite corners and, since the mapping is linear and inverted (low raw =
// high pixel), project the readings out to pixel 0 and WIDTH/HEIGHT-1 of each
// axis. Results are applied immediately and shown on screen so they can be
// copied into the XPT2046_*_MIN/MAX defines to survive a reset.
void touch_calibration(void){
    // Cross centers in screen pixels, inset from opposite corners.
    const uint16_t sx0 = XPT2046_CAL_MARGIN;
    const uint16_t sy0 = XPT2046_CAL_MARGIN;
    const uint16_t sx1 = ILI9341_WIDTH  - 1 - XPT2046_CAL_MARGIN;
    const uint16_t sy1 = ILI9341_HEIGHT - 1 - XPT2046_CAL_MARGIN;
    uint16_t raw_x0, raw_y0, raw_x1, raw_y1;

    display_fill_screen(BLACK);
    display_print_string(76, 136, "Calibration", WHITE, BLACK);
    display_print_string(56, 152, "press each cross", WHITE, BLACK);

    // Drop any event latched before entering calibration.
    touch_pressed();

    touch_cal_point(sx0, sy0, &raw_x0, &raw_y0);
    touch_cal_point(sx1, sy1, &raw_x1, &raw_y1);

    int32_t x_at_0   = raw_x0 - (((int32_t)raw_x1 - raw_x0) * sx0) / (sx1 - sx0);
    int32_t x_at_max = raw_x0 + (((int32_t)raw_x1 - raw_x0) * (ILI9341_WIDTH - 1 - sx0)) / (sx1 - sx0);
    int32_t y_at_0   = raw_y0 - (((int32_t)raw_y1 - raw_y0) * sy0) / (sy1 - sy0);
    int32_t y_at_max = raw_y0 + (((int32_t)raw_y1 - raw_y0) * (ILI9341_HEIGHT - 1 - sy0)) / (sy1 - sy0);

    // The projection can overshoot the ADC range at the edges.
    if(x_at_max < 0) x_at_max = 0;
    if(y_at_max < 0) y_at_max = 0;
    if(x_at_0 > 4095) x_at_0 = 4095;
    if(y_at_0 > 4095) y_at_0 = 4095;

