Arellano1904/Texas-Instruments-TivaC/EK-TM4C123GXL/projects/2.4inchDisplay/drivers/2.4inchDisplay.c
    display_fill_screen(BLACK);
    // A plausible panel spans well over 500 counts between the corners; less
    // than that (or a reversed span) means a mistouch — keep the old limits.
    if((x_at_0 - x_at_max) > 500 && (y_at_0 - y_at_max) > 500){
        cal_x_min = (uint16_t)x_at_max;
        cal_x_max = (uint16_t)x_at_0;
        cal_y_min = (uint16_t)y_at_max;
        cal_y_max = (uint16_t)y_at_0;
        display_print_string(0, 0, "Calibration OK", GREEN, BLACK);
        display_print_string(0, 32, "X_MIN:", WHITE, BLACK);
        display_print_int(56, 32, cal_x_min, WHITE, BLACK);
        display_print_string(0, 48, "X_MAX:", WHITE, BLACK);
        display_print_int(56, 48, cal_x_max, WHITE, BLACK);
        display_print_string(0, 64, "Y_MIN:", WHITE, BLACK);
        display_print_int(56, 64, cal_y_min, WHITE, BLACK);
        display_print_string(0, 80, "Y_MAX:", WHITE, BLACK);
        display_print_int(56, 80, cal_y_max, WHITE, BLACK);
        display_print_string(0, 112, "Copy into XPT2046_*_MIN/", WHITE, BLACK);
        display_print_string(0, 128, "MAX to keep after reset", WHITE, BLACK);
    }else{
        display_print_string(0, 0, "Calibration failed", RED, BLACK);
        display_print_string(0, 32, "Old limits kept", WHITE, BLACK);
    }
    display_print_string(0, 176, "Touch screen to exit", CYAN, BLACK);
    while(!touch_pressed()){}
    touch_cal_wait_release();
}

void touch_init(void){
    touch_spi_config();
}

void touch_int_handler(void){
    // Read interrupt status from port B.
    uint32_t int_status = MAP_GPIOIntStatus(GPIO_PORTB_BASE, true);
    // Clear interrupts immediately
    MAP_GPIOIntClear(GPIO_PORTB_BASE, int_status);
    // Set touch flag
    if(int_status & GPIO_PIN_2){// Touch pressed
        touch_asserted = 0x01;
        return;
    }
}

uint8_t touch_pressed(void){
    // Read the latched event and clear it, same pattern as pressed_button():
    // one touch interrupt produces exactly one "pressed" report.
    uint8_t pressed = touch_asserted;
    touch_asserted = 0x00;
    return pressed;
}

uint16_t touch_get_x(void){
    return touch_x;
}

uint16_t touch_get_y(void){
    return touch_y;
}

uint16_t touch_get_raw_x(void){
    return touch_raw_x;
}

uint16_t touch_get_raw_y(void){
    return touch_raw_y;
}

void touch_spi_config(void){
    // Enable SSI0 plus the GPIO ports the touch controller spans:
    //   Port A -> SSI0 data/clock lines, Port B -> CS / RESET / touch IRQ.
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_SSI0));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOA));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOB));
    // SSI0 signals on Port A: {PA2:Clk, PA4:MISO(RX), PA5:MOSI(TX)}.
    // Moved off SSI2/PB4-7 because the LaunchPad bridges PB6<->PD0 and
    // PB7<->PD1 through R9/R10, which collide with the display's SSI3 CLK/CS.
    MAP_GPIOPinConfigure(GPIO_PA2_SSI0CLK);
    MAP_GPIOPinConfigure(GPIO_PA4_SSI0RX);
    MAP_GPIOPinConfigure(GPIO_PA5_SSI0TX);
    MAP_GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5);
    // Side-band pins stay on Port B: {PB0:CS, PB1:rst, PB2:int}.
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    MAP_GPIOPinTypeGPIOInput(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Park CS high so the XPT2046 deselects and releases DOUT (high-Z) until
    // a conversion is requested; otherwise it drives the shared MISO at boot.
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, GPIO_PIN_0);
    // Enable internal pull-ups for touch interrupt //
    MAP_GPIOPadConfigSet(GPIO_PORTB_BASE,GPIO_PIN_2,GPIO_STRENGTH_2MA,GPIO_PIN_TYPE_STD_WPU);
    // Disable interrupts during setup
    MAP_GPIOIntDisable(GPIO_PORTB_BASE, GPIO_PIN_2);
    MAP_GPIOIntClear(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Configure interrupt type: falling edge
    MAP_GPIOIntTypeSet(GPIO_PORTB_BASE,GPIO_PIN_2,GPIO_FALLING_EDGE);
    // Enable GPIO interrupt (NVIC)
    MAP_IntEnable(INT_GPIOB);
    // Enable GPIO pin interrupts
    MAP_GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Config SSI0 module, master mode, 16bits len.
    MAP_SSIDisable(SSI0_BASE);
    SSIClockSourceSet(SSI0_BASE, SSI_CLOCK_SYSTEM);
    MAP_SSIConfigSetExpClk(SSI0_BASE, MAP_SysCtlClockGet(), SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,2000000, 16);
    MAP_SSIEnable(SSI0_BASE);
}
